{
    "What is an advantage of HIPS that is not provided by IDS?" : "HIPS protects critical system resources and monitors operating system processes.",
    "Which statement describes a difference between RADIUS and TACACS+?" : "RADIUS encrypts only the password whereas TACACS+ encrypts all communication.",
    "What are two disadvantages of using an IDS? (Choose two.)" : "The IDS does not stop malicious traffic.; The IDS requires other devices to respond to attacks.",
    "Which statement describes one of the rules that govern interface behavior in the context of implementing a zone-based policy firewall configuration?" : "By default, traffic is allowed to flow among interfaces that are members of the same zone.",
    "Which technique is necessary to ensure a private transfer of data using a VPN?" : "encryption",
    "What is the function of the distribution layer of the three-layer network design model?" : "aggregating access layer connections",
    "What two components of traditional web security appliances are examples of functions integrated into a Cisco Web Security Appliance? (Choose two.)" : "web reporting ; URL filtering",
    "Which AAA component can be established using token cards?" : "authentication",
    "Which statement describes a VPN?" : "VPNs use virtual connections to create a private network through a public network.",
    "What is a host-based intrusion detection system (HIDS)?" : "It combines the functionalities of antimalware applications with firewall protection.",
    "Which two devices would commonly be found at the access layer of the hierarchical enterprise LAN design model? (Choose two.)" : "Layer 2 switch ; access point",
    "Which two statements are true about NTP servers in an enterprise network? (Choose two.)" : "NTP servers at stratum 1 are directly connected to an authoritative time source. ; NTP servers ensure an accurate time stamp on logging and debugging information.",
    "In the data gathering process, which type of device will listen for traffic, but only gather traffic statistics?" : "NetFlow collector",
    "Which two protocols are link-state routing protocols? (Choose two.)" : "ISIS ; OSPF",
    "What type of route is created when a network administrator manually configures a route that has an active exit interface?" : "static",
    "Which characteristic describes a wireless client operating in active mode?" : "must know the SSID to connect to an AP",
    "What are two types of addresses found on network end devices? (Choose two.)" : "IP ; MAC",
    "What is a characteristic of the WLAN passive discover mode?" : "The AP periodically sends beacon frames containing the SSID.",
    "What is a characteristic of a routed port that is configured on a Cisco switch?" : "It is assigned an IP address.",
    "What action does an Ethernet switch take when it receives a frame with an unknown Layer 2 source address?" : "It records the source address in the address table of the switch.",
    "Which routing protocol is used to exchange routes between internet service providers?" : "BGP",
    "What is the first step in the CSMA/CA process when a wireless client is attempting to communicate on the wireless network?" : "The client listens for traffic on the channel.",
    "What Wi-Fi management frame is regularly broadcast by APs to announce their presence?" : "beacon",
    "What are the three parts of all Layer 2 frames? (Choose three.)" : "payload ; frame check sequence ; header",
    "What is a function of SNMP?" : "provides a message format for communication between network device managers and agents",
    "Which firewall feature is used to ensure that packets coming into a network are legitimate responses to requests initiated from internal hosts?" : "stateful packet inspection",
    "In which memory location is the routing table of a router maintained?" : "RAM",
    "Lightweight access points forward data between which two devices on the network? (Choose two.)" : "wireless LAN controller ; wireless client",
    "A Cisco router is running IOS 15. What are the two routing table entry types that will be added when a network administrator brings an interface up and assigns an IP address to the interface? (Choose two.)" : "local route interface ; directly connected interface",
    "Match the security service with the description." : {"allows administrator to manage network devices": "SNMP", "a series of commands that control whether a device forwards or drops packets" : "ACL"},
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : "",
    "" : ""
}
